---
kind: method
id: M:Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessGranted
source: html/3f089f69-3a06-cff9-dbc7-a2ed58192f85.htm
---
# Autodesk.Revit.DB.ExtensibleStorage.Schema.WriteAccessGranted Method

Checks whether Entities of this Schema may be stored by the current add-in.

## Syntax (C#)
```csharp
public bool WriteAccessGranted()
```

## Returns
True if write access is allowed.